<a href="https://colab.research.google.com/github/nnbphuong/datascience4biz/blob/master/Working_with_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**WORKING WITH DATAFRAMES**
> Phuong Nguyen @ [DataScience.vn](https://datascience.vn)
> 
> Dataset: https://gist.githubusercontent.com/nnbphuong/6fdcd466c618ad48d34d61450858798c/raw/a86d87a4c8f4472901828809fcc5f027174650af/WestRoxbury.csv

The data in WestRoxbury.csv includes information on single family owner-occupied homes in West Roxbury, a neighborhood in southwest Boston, MA, in 2014.

*   TOTAL VALUE: Total assessed value for property, in thousands of USD
*   TAX: Tax bill amount based on total assessed value multiplied by the tax rate, in USD
*   LOT SQ FT: Total lot size of parcel (ft^2)
*   YR BUILT: Year the property was built
*   GROSS AREA: Gross floor area
*   LIVING AREA: Total living area for residential properties (ft^2)
*   FLOORS: Number of floors
*   ROOMS: Total number of rooms
*   BEDROOMS: Total number of bedrooms
*   FULL BATH: Total number of full baths
*   HALF BATH: Total number of half baths
*   KITCHEN: Total number of kitchens
*   FIREPLACE: Total number of fireplaces
*   REMODEL: When the house was remodeled (recent/old/none)

---

# Loading the Dataset into a DataFrame

In [0]:
import pandas as pd
housing_df = pd.read_csv("https://gist.githubusercontent.com/nnbphuong/6fdcd466c618ad48d34d61450858798c/raw/a86d87a4c8f4472901828809fcc5f027174650af/WestRoxbury.csv")

In [2]:
type(housing_df)

pandas.core.frame.DataFrame

# Displaying First Few Records of the DataFrame

In [0]:
housing_df.head(5)

   TOTAL VALUE    TAX  LOT SQFT   ...  KITCHEN  FIREPLACE  REMODEL
0         344.2  4330       9965  ...        1          0     None
1         412.6  5190       6590  ...        1          0   Recent
2         330.1  4152       7500  ...        1          0     None
3         498.6  6272      13773  ...        1          1     None
4         331.5  4170       5000  ...        1          0     None

[5 rows x 14 columns]

In [0]:
housing_df.head(5).transpose()

                  0       1      2      3      4
TOTAL VALUE   344.2   412.6  330.1  498.6  331.5
TAX            4330    5190   4152   6272   4170
LOT SQFT       9965    6590   7500  13773   5000
YR BUILT       1880    1945   1890   1957   1910
GROSS AREA     2436    3108   2294   5032   2370
LIVING AREA    1352    1976   1371   2608   1438
FLOORS            2       2      2      1      2
ROOMS             6      10      8      9      7
BEDROOMS          3       4      4      5      3
FULL BATH         1       2      1      1      2
HALF BATH         1       1      1      1      0
KITCHEN           1       1      1      1      1
FIREPLACE         0       0      0      1      0
REMODEL        None  Recent   None   None   None

# Finding Summary of the DataFrame

In [3]:
housing_df.shape

(5802, 14)

In [4]:
list(housing_df.columns)

['TOTAL VALUE ',
 'TAX',
 'LOT SQFT ',
 'YR BUILT',
 'GROSS AREA ',
 'LIVING AREA',
 'FLOORS ',
 'ROOMS',
 'BEDROOMS ',
 'FULL BATH',
 'HALF BATH',
 'KITCHEN',
 'FIREPLACE',
 'REMODEL']

In [5]:
housing_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5802 entries, 0 to 5801
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   TOTAL VALUE   5802 non-null   float64
 1   TAX           5802 non-null   int64
 2   LOT SQFT      5802 non-null   int64
 3   YR BUILT      5802 non-null   int64
 4   GROSS AREA    5802 non-null   int64
 5   LIVING AREA   5802 non-null   int64
 6   FLOORS        5802 non-null   float64
 7   ROOMS         5802 non-null   int64
 8   BEDROOMS      5802 non-null   int64
 9   FULL BATH     5802 non-null   int64
 10  HALF BATH     5802 non-null   int64
 11  KITCHEN       5802 non-null   int64
 12  FIREPLACE     5802 non-null   int64
 13  REMODEL       5802 non-null   object
dtypes: float64(2), int64(11), object(1)
memory usage: 634.7+ KB

In [6]:
housing_df.describe()

       TOTAL VALUE            TAX  ...     KITCHEN    FIREPLACE
count   5802.000000   5802.000000  ...  5802.00000  5802.000000
mean     392.685715   4939.485867  ...     1.01534     0.739917
std       99.177414   1247.649118  ...     0.12291     0.565108
min      105.000000   1320.000000  ...     1.00000     0.000000
25%      325.125000   4089.500000  ...     1.00000     0.000000
50%      375.900000   4728.000000  ...     1.00000     1.000000
75%      438.775000   5519.500000  ...     1.00000     1.000000
max     1217.800000  15319.000000  ...     2.00000     4.000000

[8 rows x 13 columns]

# Slicing and Indexing a DataFrame

## Selecting Rows by Indexes

In [0]:
housing_df[0:5]

   TOTAL VALUE    TAX  LOT SQFT   ...  KITCHEN  FIREPLACE  REMODEL
0         344.2  4330       9965  ...        1          0     None
1         412.6  5190       6590  ...        1          0   Recent
2         330.1  4152       7500  ...        1          0     None
3         498.6  6272      13773  ...        1          1     None
4         331.5  4170       5000  ...        1          0     None

[5 rows x 14 columns]

In [0]:
housing_df[-5:]

      TOTAL VALUE    TAX  LOT SQFT   ...  KITCHEN  FIREPLACE  REMODEL
5797         404.8  5092       6762  ...        1          1   Recent
5798         407.9  5131       9408  ...        1          1     None
5799         406.5  5113       7198  ...        1          1     None
5800         308.7  3883       6890  ...        1          0     None
5801         447.6  5630       7406  ...        1          1     None

[5 rows x 14 columns]

## Selecting Columns by Column Names

In [0]:
housing_df.TAX[0:5]

0    4330
1    5190
2    4152
3    6272
4    4170
Name: TAX, dtype: int64

In [0]:
housing_df['TOTAL VALUE '][0:5]

0    344.2
1    412.6
2    330.1
3    498.6
4    331.5
Name: TOTAL VALUE , dtype: float64

In [0]:
housing_df[['TOTAL VALUE ', 'TAX', 'ROOMS']][0:5]

   TOTAL VALUE    TAX  ROOMS
0         344.2  4330      6
1         412.6  5190     10
2         330.1  4152      8
3         498.6  6272      9
4         331.5  4170      7

In [9]:
housing_df[['TOTAL VALUE ', 'TAX', 'ROOMS']].describe()

       TOTAL VALUE            TAX        ROOMS
count   5802.000000   5802.000000  5802.000000
mean     392.685715   4939.485867     6.994829
std       99.177414   1247.649118     1.437657
min      105.000000   1320.000000     3.000000
25%      325.125000   4089.500000     6.000000
50%      375.900000   4728.000000     7.000000
75%      438.775000   5519.500000     8.000000
max     1217.800000  15319.000000    14.000000

## Selecting Rows and Columns by Indexes

In [0]:
housing_df.iloc[4:9, 1:4]

    TAX  LOT SQFT   YR BUILT
4  4170       5000      1910
5  4244       5142      1950
6  4521       5000      1954
7  4030      10000      1950
8  4195       6835      1958

# Finding Value Counts and Cross Tabulations

## Finding Unique Occurances of Values in Columns

In [0]:
housing_df['FLOORS '].value_counts()

2.0    3415
1.0    1505
1.5     773
2.5     105
3.0       4
Name: FLOORS , dtype: int64

In [0]:
housing_df.REMODEL.value_counts()

None      4346
Recent     875
Old        581
Name: REMODEL, dtype: int64

In [0]:
housing_df.REMODEL.value_counts(normalize=True)*100

None      74.905205
Recent    15.081007
Old       10.013788
Name: REMODEL, dtype: float64

## Finding Cross-Tabulation between Two Columns

In [0]:
pd.crosstab(housing_df['FLOORS '], housing_df['REMODEL'] )

REMODEL  None  Old  Recent
FLOORS
1.0      1246  112     147
1.5       560   89     124
2.0      2490  361     564
2.5        48   18      39
3.0         2    1       1

# Sorting DataFrame by Column Values

In [0]:
housing_df[['TOTAL VALUE ', 'FLOORS ']].sort_values('TOTAL VALUE ')[0:5]

     TOTAL VALUE   FLOORS
325         105.0      1.0
258         144.6      1.5
244         167.6      1.0
608         171.8      1.0
577         176.9      2.0

In [0]:
housing_df[['TOTAL VALUE ', 'FLOORS ']].sort_values('TOTAL VALUE ', ascending = False)[0:5]

      TOTAL VALUE   FLOORS
4571        1217.8      2.0
4179        1009.9      2.0
4151         996.9      2.0
3804         936.0      2.0
2118         935.1      1.0

# Creating New Columns

In [0]:
housing_df['PRICE'] = housing_df['TOTAL VALUE '] + housing_df['TAX']/1000
housing_df[['TOTAL VALUE ', 'TAX', 'PRICE']][0:5]

   TOTAL VALUE    TAX    PRICE
0         344.2  4330  348.530
1         412.6  5190  417.790
2         330.1  4152  334.252
3         498.6  6272  504.872
4         331.5  4170  335.670

In [0]:
housing_df[['TOTAL VALUE ', 'TAX', 'PRICE']].sort_values('PRICE', ascending = False)[0:5]

      TOTAL VALUE     TAX     PRICE
4571        1217.8  15319  1233.119
4179        1009.9  12704  1022.604
4151         996.9  12541  1009.441
3804         936.0  11774   947.774
2118         935.1  11763   946.863

# Grouping and Aggregating

In [0]:
housing_df['TOTAL VALUE '].mean()

392.6857149258885

In [0]:
housing_df.groupby('FLOORS ')['TOTAL VALUE '].mean()

FLOORS
1.0    327.849269
1.5    350.208779
2.0    425.663611
2.5    555.396686
3.0    570.025000
Name: TOTAL VALUE , dtype: float64

In [0]:
housing_df.groupby(['FLOORS ', 'REMODEL'])['TOTAL VALUE '].mean()

FLOORS   REMODEL
1.0      None       323.045104
         Old        329.477679
         Recent     367.329592
1.5      None       339.932536
         Old        359.384382
         Recent     390.031903
2.0      None       414.410694
         Old        432.278186
         Recent     471.110241
2.5      None       549.011500
         Old        546.733333
         Recent     567.253846
3.0      None       595.200000
         Old        576.100000
         Recent     513.600000
Name: TOTAL VALUE , dtype: float64

# Joining DataFrames

In [0]:
# reset_index() is a method to reset index of a DataFrame. 
value_by_floors = housing_df.groupby('FLOORS ')['TOTAL VALUE '].mean().reset_index()
value_by_floors

In [0]:
value_by_floors_remodel = housing_df.groupby(['FLOORS ', 'REMODEL'])['TOTAL VALUE '].mean().reset_index()
value_by_floors_remodel

In [0]:
# The join type can be of inner, outer, lef or right joins and should be specifed in the how parameter.
# For understanding diﬀerent joins, please refer to the examples given at https://www.w3schools.com/sql/sql_join.asp
value_comparison = value_by_floors_remodel.merge(value_by_floors, on = 'FLOORS ', how = 'outer')
value_comparison

# Re-naming Columns

In [0]:
value_comparison.rename(columns = {'TOTAL VALUE _x': 'VALUE_FLOORS_REMODEL',
'TOTAL VALUE _y': 'VALUE_FLOORS'}, inplace = True)
value_comparison.head(5)

In [0]:
value_comparison['CHANGE'] = (value_comparison['VALUE_FLOORS_REMODEL'] - value_comparison['VALUE_FLOORS']) / value_comparison['VALUE_FLOORS']
value_comparison.head(5)

# Filtering Records from Dataframe Based on Conditions

In [0]:
housing_df[housing_df['FLOORS '] == 3][['TOTAL VALUE ', 'REMODEL']]

# Removing a Column/Row

In [0]:
# To drop a column, pass the column name and axis as 1. To drop a row, pass the row index and axis as 0.
# To avoid creating new DataFrames and make changes to the existing DataFrame, set inplace parameter to True.
# housing_df.drop('TAX', inplace = True, axis = 1)
housing_without_tax_df = housing_df.drop('TAX', axis = 1)

In [0]:
housing_df.head(5)

In [0]:
housing_without_tax_df.head(5)

---
**Reference**

Pradhan, M. and Kumar, U. D. (2019). *Machine Learning using Python*. Wiley India Pvt. Ltd.